khuram11/OTA_on_STM32H7S3/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
      /* Wait for 100 ms after Reset */
      USBH_Delay(100U);

      phost->device.speed = (uint8_t)USBH_LL_GetSpeed(phost);

#if defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U)
      phost->NakTimeout = USBH_NAK_SOF_COUNT;
#endif /* defined (USBH_IN_NAK_PROCESS) && (USBH_IN_NAK_PROCESS == 1U) */

      phost->gState = HOST_ENUMERATION;

      phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
      phost->Control.pipe_in  = USBH_AllocPipe(phost, 0x80U);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

      /* Open Control pipes */
      (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
                          phost->device.address, phost->device.speed,
                          USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_ENUMERATION:
      /* Check for enumeration status */
      status = USBH_HandleEnum(phost);
      if (status == USBH_OK)
      {
        /* The function shall return USBH_OK when full enumeration is complete */
        USBH_UsrLog("Enumeration done.");

        phost->device.current_interface = 0U;

        if (phost->device.DevDesc.bNumConfigurations == 1U)
        {
          USBH_UsrLog("This device has only 1 configuration.");
          phost->gState = HOST_SET_CONFIGURATION;
        }
        else
        {
          phost->gState = HOST_INPUT;
        }

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_STATE_CHANGED_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
      break;

    case HOST_INPUT:
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
        USBH_OS_PutMessage(phost, USBH_STATE_CHANGED_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      }
    }
    break;

    case HOST_SET_CONFIGURATION:
      /* set configuration */
      if (USBH_SetCfg(phost, (uint16_t)phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
      {
        phost->gState = HOST_SET_WAKEUP_FEATURE;
        USBH_UsrLog("Default configuration set.");
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case  HOST_SET_WAKEUP_FEATURE:

      if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U)
      {
        status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

        if (status == USBH_OK)
        {
          USBH_UsrLog("Device remote wakeup enabled");
          phost->gState = HOST_CHECK_CLASS;
        }
        else if (status == USBH_NOT_SUPPORTED)
        {
          USBH_UsrLog("Remote wakeup not supported by the device");
          phost->gState = HOST_CHECK_CLASS;
        }
        else
        {
          /* .. */
        }
      }
      else
      {
        phost->gState = HOST_CHECK_CLASS;
      }

#if (USBH_USE_OS == 1U)
      USBH_OS_PutMessage(phost, USBH_PORT_EVENT, 0U, 0U);
#endif /* (USBH_USE_OS == 1U) */
      break;

    case HOST_CHECK_CLASS:
        if (phost->ClassNumber == 0U)
        {
            USBH_UsrLog("No Class has been registered.");
        }
        else
        {
            phost->pActiveClass = NULL;

            /* Print interfaces for debug */
            USBH_UsrLog("=== DEVICE INTERFACES ===");
            for (uint8_t i = 0U; i < phost->device.CfgDesc.bNumInterfaces; i++)
            {
                USBH_UsrLog("IF%d: Class=0x%02X Sub=0x%02X Proto=0x%02X EPs=%d",
                           i,
                           phost->device.CfgDesc.Itf_Desc[i].bInterfaceClass,
                           phost->device.CfgDesc.Itf_Desc[i].bInterfaceSubClass,
                           phost->device.CfgDesc.Itf_Desc[i].bInterfaceProtocol,
                           phost->device.CfgDesc.Itf_Desc[i].bNumEndpoints);
            }
            USBH_UsrLog("=========================");

            /* Try matching on interface 0 first */
            for (idx = 0U; idx < phost->ClassNumber; idx++)
            {
                if (phost->pClass[idx]->ClassCode == phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass)
                {
                    phost->pActiveClass = phost->pClass[idx];
                    break;
                }
            }

            /* Force CDC for known modem VIDs */
            if (phost->pActiveClass == NULL)
            {
                uint16_t vid = phost->device.DevDesc.idVendor;

                if ((vid == 0x1E0E) ||  /* SIMCOM */
                    (vid == 0x2C7C) ||  /* Quectel */
                    (vid == 0x05C6))    /* Qualcomm */
                {
                    for (idx = 0U; idx < phost->ClassNumber; idx++)
                    {
                        if ((phost->pClass[idx]->ClassCode == 0x02U) ||
                            (phost->pClass[idx]->ClassCode == 0xFFU))
                        {
                            phost->pActiveClass = phost->pClass[idx];
                            break;
                        }
                    }
                }
            }

            if (phost->pActiveClass != NULL)
            {
                if (phost->pActiveClass->Init(phost) == USBH_OK)
                {
                    phost->gState = HOST_CLASS_REQUEST;
                    USBH_UsrLog("%s class started.", phost->pActiveClass->Name);
                    phost->pUser(phost, HOST_USER_CLASS_SELECTED);
                }
                else
                {
                    phost->gState = HOST_ABORT_STATE;
                    USBH_UsrLog("Device not supporting %s class.", phost->pActiveClass->Name);
                }
            }
            else
            {
                phost->gState = HOST_ABORT_STATE;
                USBH_UsrLog("No registered class for this device.");
            }
        }
        break;

    case HOST_CLASS_REQUEST:
        if (phost->pActiveClass != NULL)
        {
            status = phost->pActiveClass->Requests(phost);

